# GetFormatOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..GetFormatOptions Method
ColorFillScheme Class See Also
---
Returns the FormatOptions of the scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public FormatOptions GetFormatOptions()
```

Visual Basic
---
```text
Public Function GetFormatOptions As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetFormatOptions()
```

# Remarks
This method will return the default FormatOptions if the scheme is by value.
# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace